I have tested this example:
```
  # aws_networkfirewall_rule_group.example will be created
  + resource "aws_networkfirewall_rule_group" "example" {
      + arn          = (known after apply)
      + capacity     = 100
      + id           = (known after apply)
      + name         = "example"
      + tags         = {
          + "Tag1" = "Value1"
          + "Tag2" = "Value2"
        }
      + tags_all     = {
          + "Tag1" = "Value1"
          + "Tag2" = "Value2"
        }
      + type         = "STATEFUL"
      + update_token = (known after apply)

      + rule_group {
          + rule_variables {
              + ip_sets {
                  + key = "EXTERNAL_HOST"

                  + ip_set {
                      + definition = [
                          + "1.2.3.4/32",
                        ]
                    }
                }
              + ip_sets {
                  + key = "WEBSERVERS_HOSTS"

                  + ip_set {
                      + definition = [
                          + "10.0.0.0/16",
                          + "10.0.1.0/24",
                          + "192.168.0.0/16",
                        ]
                    }
                }

              + port_sets {
                  + key = "HTTP_PORTS"

                  + port_set {
                      + definition = [
                          + "443",
                          + "80",
                        ]
                    }
                }
            }

          + rules_source {
              + rules_string = <<-EOT
                    drop udp $HOME_NET any -> $EXTERNAL_NET !123 (msg:"Drop All non-TCP:443"; sid:172191; priority:100; rev:1;)
                    drop udp $HOME_NET any -> $EXTERNAL_NET !53 (msg:"Drop All non-TCP:443"; sid:172192; priority:200; rev:1;)
                    drop tcp $HOME_NET any -> $EXTERNAL_NET !443 (msg:"Drop All non-TCP:443"; sid:172193; priority:200; rev:1;)
                    drop tls any any -> any any (msg:"match SSLv2, SSLv3, TLS1.0, TLS1.1";ssl_version:sslv2,sslv3,tls1.0,tls1.1; sid:172194;)
                    
                    
                EOT
            }
        }
    }
Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_networkfirewall_rule_group.example: Creating...
aws_networkfirewall_rule_group.example: Creation complete after 5s [id=arn:aws:network-firewall:us-east-1:********:stateful-rulegroup/example]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```